{
  "Current_Affairs":  [
    "India becoming a $5 trillion economy  challenges and opportunities",
    "India's journey towards becoming a $5 trillion economy",
    "Impact of global recession on India",
    "Impact of global recession on students and job opportunities",
    "India's role in BRICS expansion",
    "India's growing role in BRICS  what does it mean for us?",
    "Is India ready for 100% digital governance?",
    "Is India ready for complete digital governance?",
    "Impact of climate change on developing nations",
    "Climate change and its impact on daily life in India",
    "India's space achievements and their global impact",
    "India's achievements in space missions and why they matter",
    "Is Uniform Civil Code necessary in India?",
    "Is the Uniform Civil Code needed in India?",
    "Depreciation of the Indian Rupee - causes and impact on common people",
    "China's economic slowdown - how does it affect India?",
    "Raising the legal age of marriage for women - pros and cons",
    "Russia-Ukraine conflict  how it affects India's economy",
    "Impact of COVID-19 on India's health and education sectors",
    "Inflation in India  Why are prices rising?",
    "Atmanirbhar Bharat  is India becoming more self-reliant?",
    "Use of technology in farming  is it helping farmers?",
    "Deepfakes  risks and how students should be aware",
    "The gig economy  are gig jobs good for youth?",
    "National Education Policy 2020  benefits and challenges",
    "Electric vehicles in India  are we ready for the transition?",
    "Social media misinformation  how it affects public opinion",
    "Digital payments boom in India  is cash disappearing?",
    "Air pollution in major Indian cities  causes and solutions",
    "Should India focus more on renewable energy?",
    "Unemployment among youth  what is the root cause?",
    "Is online education here to stay?"
  ],
  "Social_Issues": [
    "Unemployment among educated youth",
    "Mental health awareness in India",
    "Gender equality in workplaces",
    "Poverty vs. Economic Growth",
    "Urbanization and its challenges",
    "Drug abuse among students",
    "Safety of women in India",
    "Rural vs urban divide in India",
    "Access to quality healthcare in rural India",
    "Corruption in public services",
    "Increasing crime rates among youth",
    "Impact of social pressure on student mental health",
    "Social stigma around mental illness",
    "Child labor in India causes and solutions",
    "Domestic violence and its rising cases",
    "Women empowerment  how far have we come?",
    "Impact of fast food culture on society",
    "Caste-based discrimination in modern India",
    "Human trafficking  awareness and prevention",
    "Stress and burnout among students",
    "Work-life balance challenges in Indian families",
    "Are we losing human values in the digital age?",
    "Population rise in India  opportunities and challenges",
    "Education inequality in India",
    "Impact of migration on families and children",
    "Is India doing enough for senior citizens?",
    "Effect of poverty on children's education",
    "Men's mental health  an ignored topic",
    "Increasing road accidents  causes and solutions",
    "Is India becoming more intolerant?"
  ],
  "Business":  [
    "Is the startup boom in India sustainable?",
    "Mergers and acquisitions: Do they benefit customers?",
    "Influence of corporate social responsibility (CSR)",
    "Is franchising a better model than starting your own business?",
    "Should companies focus more on employee well-being than profits?",
    "Impact of remote work on productivity",
    "Is brand loyalty declining in the digital era?",
    "Is work-from-home the future of business?",
    "Role of small businesses in India's economic growth",
    "Impact of e-commerce on traditional retail stores",
    "Are subscription-based business models here to stay?",
    "Is influencer marketing effective for brands?",
    "Should companies invest more in employee skill development?",
    "Is digital marketing replacing traditional marketing?",
    "Impact of globalization on Indian businesses",
    "Are Indian companies innovative enough to compete globally?",
    "How ethical are advertising practices today?",
    "Should companies prioritize sustainability over profits?",
    "Has customer service improved with digital tools?",
    "Are family-run businesses still relevant in India?",
    "Impact of startups on youth career choices",
    "Is artificial intelligence changing business decision-making?",
    "Do companies need to worry about data privacy more than ever?",
    "Gig economy and its impact on the business world",
    "Is outsourcing still a good business strategy?",
    "Should companies adopt a 4-day workweek?",
    "Rise of D2C (Direct-to-Consumer) brands  trend or future?",
    "Corporate layoffs  necessary or avoidable?",
    "Impact of celebrity endorsements on brand value",
    "Is employee monitoring ethical in companies?"
  ],
  "Economy": [
    "Cashless economy: Pros and Cons",
    "Inflation vs. purchasing power - a growing concern",
    "Role of small and medium enterprises (SMEs) in India's economy",
    "India's taxation system - Is it citizen friendly?",
    "FDI in India - Boon or threat?",
    "Impact of subsidies on the economy",
    "Is privatization beneficial for India?",
    "Impact of rising fuel prices on common people",
    "How does unemployment affect the economy?",
    "Is the Indian economy recovering after COVID-19?",
    "Should India increase spending on public healthcare?",
    "Is India becoming more self-reliant economically?",
    "Economic impact of population growth in India",
    "Do government welfare schemes actually help the poor?",
    "Are startups contributing enough to India's economy?",
    "Impact of global recession on India's economic growth",
    "Will the gig economy strengthen India's workforce?",
    "Should India reduce its dependence on imports?",
    "Is the stock market a true reflection of the economy?",
    "Economic impact of digital payments in India",
    "Does foreign trade help India grow faster?",
    "Is tourism a major revenue source for India?",
    "Economic inequality in India  widening gap or improving?",
    "Impact of demonetization  success or failure?",
    "Should agricultural income be taxed?",
    "Role of women in boosting India's economy",
    "Is India ready for a universal basic income?",
    "Are public sector companies efficient or a burden?",
    "Can renewable energy boost India's economy?",
    "Economic impact of brain drain in India"
  ],
  "Technology": [
    "Is Artificial Intelligence taking away jobs?",
    "Cybersecurity: The biggest challenge of the digital age",
    "Future of electric vehicles in India",
    "Blockchain beyond crypto - practical applications",
    "Data privacy vs. convenience: What matters more?",
    "5G and its impact on business and society",
    "Automation in industries: Threat or opportunity?",
    "Is AI making our lives easier or more vulnerable?",
    "The role of robotics in future manufacturing",
    "Are cryptocurrencies here to stay?",
    "Internet of Things (IoT): How is it changing our daily lives?",
    "Is quantum computing the future of computing?",
    "Virtual Reality (VR) and Augmented Reality (AR): Use cases beyond gaming",
    "Will smart homes become the norm?",
    "Can green tech solve the climate crisis?",
    "Big Data: Boon or threat to personal privacy?",
    "Is 3D printing changing the manufacturing landscape?",
    "Drones: Applications and concerns for policy makers",
    "Telemedicine: Can it bridge the healthcare gap?",
    "EdTech: Is technology improving education or just changing its face?",
    "Are tech monopolies too powerful?",
    "Digital divide: Who is being left out in the tech boom?",
    "How safe are autonomous vehicles?",
    "Gene editing (CRISPR): Promise or peril?",
    "Is cloud computing the backbone of modern business?",
    "Smart cities: Reality or just a dream?",
    "Can blockchain improve transparency in governance?",
    "Will wearable technology dominate health monitoring?"
  ],
  "Case_Study_Based": [
    "A company's sales drop by 20% in one quarter. Suggest a strategy.",
    "Your team misses a project deadline due to internal conflicts. Provide a solution.",
    "A new product launch fails. Identify reasons and propose solutions.",
    "A company is facing high employee attrition. Suggest ways to retain talent.",
    "A retail brand wants to go fully online. What challenges and steps should they consider?",
    "A college faces a drop in admission rates. Suggest a recovery plan.",
    "A startup is running out of funds in six months. Propose a survival strategy.",
    "An e-commerce company faces customer complaints about delivery delays. Recommend improvements.",
    "A manufacturing company wants to adopt automation but employees fear job losses. Suggest a balanced plan.",
    "A social media app is losing daily active users. Identify causes and propose fixes.",
    "A city's public transport system is overcrowded and inefficient. Propose a solution.",
    "A hospital receives criticism for poor patient satisfaction. Suggest a turnaround plan.",
    "A fast-food chain wants to expand internationally. What factors should they consider?",
    "A mobile network provider faces frequent outages. Recommend technical and managerial solutions.",
    "An NGO's donations have decreased by 40%. Provide strategies to increase engagement.",
    "A university wants to shift to a competency-based curriculum. Identify challenges and solutions.",
    "A software firm is struggling with low productivity in remote teams. Suggest improvements.",
    "A clothing brand is accused of copying designs. How should the company respond?",
    "A tourism destination reports a sharp decline in visitors. Suggest a revival plan.",
    "A new EdTech startup faces tough competition. Propose steps to gain market share."
  ],
  "Education_Student_Centric": [
    "Are Indian graduates job-ready?",
    "Should coding be mandatory for all students?",
    "Online vs. offline education  which is better?",
    "Should internships be mandatory for degree completion?",
    "Importance of skill-based learning in modern education",
    "Is the Indian education system too exam-focused?",
    "Impact of social pressure on student mental health",
    "Gap year between studies  beneficial or waste of time?",
    "Should financial literacy be taught in schools and colleges?",
    "Is NEP 2020 beneficial for students?",
    "Do Indian colleges provide enough practical exposure?",
    "Should attendance be mandatory in colleges?",
    "Is the grading system fair to all students?",
    "Role of technology in improving learning outcomes",
    "Are entrance exams the right way to judge student capability?",
    "Should schools reduce homework load on students?",
    "Is studying abroad worth the cost?",
    "Are extracurricular activities as important as academics?",
    "How can educational institutions support mental wellness?",
    "Should AI tools like ChatGPT be allowed for learning?"
  ],
  "Social_Media": [
    "Does social media promote unrealistic lifestyles?",
    "Impact of social media on student productivity?",
    "Should social media platforms be regulated?",
    "Influence of influencers on consumer behavior",
    "Is social media responsible for spreading misinformation?",
    "Social media addiction among youth",
    "Are WhatsApp and Telegram replacing traditional news sources?",
    "Is social media affecting real-life communication skills?",
    "Should there be an age limit for social media usage?",
    "Can social media be used effectively for education?",
    "Is cancel culture justified?",
    "Does social media help in building communities or dividing society?",
    "Are short-form content platforms like Reels and TikTok reducing attention span?",
    "Should political advertising be allowed on social media?",
    "Is social media a threat to privacy?",
    "Role of social media during crisis and disasters",
    "Do social media trends positively influence youth?",
    "Is the blue-tick culture creating unnecessary social pressure?"
  ]
}
